perf/async/async_basic.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: start
      duration: 30
      arrivalRate: 1
    - name: Positive Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 5
    - name: Plain
      duration: 30
      arrivalRate: 5
    - name: Negative Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 1
    - name: final
      duration: 30
      arrivalRate: 5

scenarios:
  - name: Bbox-9091
    flow:
      - get:
          url: '/async'