perf/async/async_incremental.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: start
      duration: 30
      arrivalRate: 5
    - name: Ramp 1
      duration: 60
      arrivalRate: 5
      rampTo: 20
    - name: Plain 1
      duration: 30
      arrivalRate: 20
    - name: Ramp 2
      duration: 60
      arrivalRate: 20
      rampTo: 30
    - name: final
      duration: 30
      arrivalRate: 10

scenarios:
  - name: Bbox-9091
    flow:
      - get:
          url: '/async'