perf/async/async_pico.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:

    - name: start
      duration: 30
      arrivalRate: 30
    - name: Ramp 1
      duration: 45
      arrivalRate: 30
      rampTo: 100
    - name: Spike
      duration: 15
      arrivalRate: 500
    - name: Ramp 2
      duration: 45
      arrivalRate: 30
      rampTo: 100
    - name: final
      duration: 30
      arrivalRate: 30

scenarios:
  - name: Bbox-9091
    flow:
      - get:
          url: '/async'